<?php

return [
    'welcome' => 'Добро пожаловать!',
    'success' => 'Операция выполнена успешно.',


    'login'   => "Вы успешно авторизовались!",
    'register' => "Вы успешно зарегистрировались! Выполнена автоматическая авторизация.",
    'logout' => "Вы успешно вышли из аккаунта!",

    'offline' => "Авторизация через социальные сети отключена Администрацией!",
    'ban'     => 'Ваш аккаунт заблокирован!',
    'provider' => "Используйте другую учётную запись для авторизации!" ,
    'not_user' => "Пользователь не найден!",
    'link_auth' => "Авторизоваться через ",




    // другие переводы
];
